app/policies/todo_list_policy.rb

SELECT 1 AS one FROM "collaborators" WHERE "collaborators"."todo_list_id" = 1 AND "collaborators"."user_id" = 2 LIMIT 1
SELECT 1 AS one FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."todo_list_id" = 5 AND "users"."id" = 1 LIMIT 1
---
  def collab?
    todo_list.collaborators_users.include?(user)