app/policies/todo_policy.rb

  def collab?
    todo.todo_list.collaborators_users.include?(user)
---
SELECT DISTINCT "todos".* FROM "todos" LEFT OUTER JOIN "todo_lists" "todo_list" ON "todo_list"."id" = "todos"."todo_list_id" LEFT OUTER JOIN "collaborators" ON "collaborators"."todo_list_id" = "todo_list"."id" WHERE ("todo_list"."user_id" = 1 OR "collaborators"."user_id" = 1)
SELECT 1 AS one FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."todo_list_id" = 8 AND "users"."id" = 1 LIMIT 1