app/controllers/api/v1/collaborators_controller.rb

  def create
    @collaborator = @todo_list.collaborators.create(collaborator_params)
---
INSERT INTO "collaborators" ("user_id", "todo_list_id", "created_at", "updated_at") VALUES (2, 1, '2025-02-18 06:31:04.237049', '2025-02-18 06:31:04.237049') RETURNING "id"

  def destroy
    begin
      @collaborator = @todo_list.collaborators.find(params[:id])
      if @collaborator.destroy!
---
SELECT "collaborators".* FROM "collaborators" WHERE "collaborators"."todo_list_id" = 10
DELETE FROM "collaborators" WHERE "collaborators"."id" = 2

  def find_todo_list
    @todo_list = current_user.todo_lists.find_by(id: params[:todo_list_id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = 1 AND "todo_lists"."id" IS NULL LIMIT 1