app/controllers/api/v1/todo_list_controller.rb

INSERT INTO "todo_lists" ("heading", "created_at", "updated_at", "user_id") VALUES ('trial', '2025-02-24 08:46:45.508985', '2025-02-24 08:46:45.508985', 1) RETURNING "id"
---
  def create
    todo_list = TodoList.new(todo_list_params.merge(user_id: current_user.id))
    authorize todo_list
    if todo_list.save && todo_list.valid?

UPDATE "todo_lists" SET "heading" = 'trial 3', "updated_at" = '2025-02-24 08:50:22.289894' WHERE "todo_lists"."id" = 14
---
  def update
    @todo_list = policy_scope(TodoList).find(params[:id])
    authorize @todo_list
    if @todo_list.update!(todo_list_params)

DELETE FROM "todo_lists" WHERE "todo_lists"."id" = 12
---
  def destroy
    @todo_list = policy_scope(TodoList).find(params[:id])
    authorize @todo_list
    if @todo_list.destroy!

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = 3 LIMIT 1
---
  def find_todo_list
    @todo_list = TodoList.find(params[:id])