app/controllers/api/v1/todos_controller.rb

UPDATE "todos" SET "updated_at" = '2025-02-24 08:58:03.777523', "status" = 'in_progress' WHERE "todos"."id" = 11
---
  def update
    begin
      # todo = @todo_list.todos.find(params[:id])
      # todo = policy_scope(Todo).find(params[:id])
      todo = policy_scope(Todo).find_by(id: params[:id])

      Rails.logger.debug "Data1?#{todo.to_json}"
      authorize todo
      Rails.logger.debug "Data2?#{todo.to_json}"
      if todo.update!(todo_params)