app/controllers/api/v1/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."todo_list_id" = 2 AND "todos"."id" = 1 LIMIT 1
---
  def show

    todo = @todo_list.todos.find(params[:id])

INSERT INTO "todos" ("heading", "content", "created_at", "updated_at", "todo_list_id", "status") VALUES ('market', 'buy some veggies', '2025-02-24 12:31:25.346298', '2025-02-24 12:31:25.346298', 10, 'pending') RETURNING "id"
---
  def create
    todo = @todo_list.todos.create(todo_params)

UPDATE "todos" SET "heading" = 'movie', "content" = 'go to movie', "updated_at" = '2025-02-18 05:17:36.821770' WHERE "todos"."id" = 2
---
  def update
    todo = policy_scope(Todo).find_by(id: params[:id])
    authorize todo
    if todo.update!(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = 13
---
  def destroy
    todo = policy_scope(Todo).find_by(id: params[:id])
    authorize todo
    if todo.destroy!

SELECT "todos".* FROM "todos" WHERE "todos"."id" = 6 LIMIT 1
---
  def start
    todo = Todo.find(params[:id])

SELECT "todos".* FROM "todos" WHERE "todos"."id" = 11 LIMIT 1
---
  def complete
    todo = Todo.find(params[:id])