app/controllers/api/v1/todo_list_controller.rb

  def create
    Rails.logger.debug "Is current user ? #{current_user.inspect}"
     todo_list = TodoList.new(todo_list_params.merge(user_id: current_user.id))
      # todo_list = policy_scope(TodoList).new(todo_list_params)
      # Rails.logger.debug "Is todo_list ? #{current_user.todo_lists}"
      Rails.logger.debug "Is todo_list before authorization ? #{todo_list.inspect}"

      authorize todo_list
      Rails.logger.debug "Is todo_list after authorization? #{todo_list.inspect}"
      if todo_list.save && todo_list.valid?
---
INSERT INTO "todo_lists" ("heading", "created_at", "updated_at", "user_id") VALUES ('party', '2025-02-20 10:09:25.946942', '2025-02-20 10:09:25.946942', 2) RETURNING "id"

  def update
    begin
      @todo_list = policy_scope(TodoList).find(params[:id])
      authorize @todo_list
      if @todo_list.update!(todo_list_params)
---
UPDATE "todo_lists" SET "heading" = 'GROCERY', "updated_at" = '2025-02-20 10:18:50.344564' WHERE "todo_lists"."id" = 9

  def destroy
    begin
      @todo_list = policy_scope(TodoList).find(params[:id])
      authorize @todo_list
      if @todo_list.destroy!
---
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = 6

  def find_todo_list
    @todo_list = TodoList.find(params[:id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = 1 LIMIT 1