app/controllers/api/v1/users_controller.rb

  def destroy
    user = User.find(params[:id])
    user.destroy
---
DELETE FROM "users" WHERE "users"."id" = 6