app/controllers/api/v1/users_controller.rb

   def index
     users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."uid" = 's@gmail.com' LIMIT 1

   def show
     begin
       @user= User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

   def update
     begin
       @user = User.find(params[:id])
       if @user.update!(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
UPDATE "users" SET "uid" = 'ma@gmail.com', "email" = 'ma@gmail.com', "updated_at" = '2025-02-17 11:17:58.538037' WHERE "users"."id" = 3

   def destroy
     begin
       user = User.find(params[:id])
       user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 1