app/controllers/todo_lists_controller.rb

  def index
    todo_lists = policy_scope(current_user.todo_lists.includes(:todos))
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = $1  [["user_id", 1]]

  def create
    todo_list = current_user.todo_lists.create(todo_list_params)
---
INSERT INTO "todo_lists" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "My Tasks"], ["user_id", 2], ["created_at", "2025-02-17 06:00:42.108396"], ["updated_at", "2025-02-17 06:00:42.108396"]]

  def destroy
    # todo_list = current_user.todo_lists.find_by(id: params[:id])
    authorize @todo_list
    if @todo_list&.destroy
---
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = $1  [["id", 3]]

  def set_todo_list
    @todo_list = current_user.todo_lists.find_by(id: params[:id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = $1 AND "todo_lists"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 3], ["LIMIT", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."todo_list_id" = $1  [["todo_list_id", 3]]