app/controllers/todos_controller.rb

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = $1 AND "todo_lists"."id" = $2 LIMIT $3  [["user_id", 182], ["id", 1], ["LIMIT", 1]]
---
  def create
    todo_list = current_user.todo_lists.find(params[:todo][:todo_list_id])