app/controllers/users_controller.rb

  def show
    user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "test@example.com"], ["LIMIT", 1]]